<?php

namespace Sajidh\Dhivehidate;

interface Imonthday
{
    const MONTHS = [
        1  => 'ޖެނުެަރީ', 2 => 'ފެބުރުއަރީ', 3 => 'މާރިޗް',
        4  => 'އޭޕްރީލް', 5 => 'މޭ', 6 => 'ޖޫން',
        7  => 'ޖުލައި', 8 => 'އޮގަސްޓް', 9 => 'ސެޕްޓެމްބާރ',
        10 => 'އޮކްޓޯބާރ', 11 => 'ޏޮވެމްބާރ', 12 => 'ޑިސެމްބާރ',
    ];

    const DAYOFWEEK = [
        0 => 'އާދިއްތަ', 1 => 'ހޯމަ', 2 => 'އަންގާރަ',
        3 => 'ބުދަ', 4 => 'ބުރާސްފަތި', 5 => 'ހުކުރު',
        6 => 'ހޮނިހިރު',
    ];

    const FORMAT = 'j M Y';

    const AMPM = [
        'am' => 'މެންދުރުކުރި', 'pm' => 'މެންދުރުފަސް',
    ];
}
